Repository: sherifmadkor/Min_elgasos_game
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Min el Gasos
ar: مين الجاسوس

source: Play Offline
ar: لعب بدون إنترنت

source: Play Online
ar: اللعب عبر الإنترنت

source: Settings
ar: الإعدادات

source: Profile
ar: الملف الشخصي

source: No user logged in
ar: لا يوجد مستخدم مسجل الدخول

# noUserData
source: No user data found
ar: لا توجد بيانات للمستخدم

source: Change Name
ar: تغيير الاسم

source: Enter new name
ar: اكتب الاسم الجديد

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Back
ar: رجوع

source: Games Played
ar: مباريات لعبت

source: Wins
ar: عدد مرات الفوز

source: Spy Wins
ar: فوز كجاسوس

source: Detective Wins
ar: فوز كمحقق

# xpPoints
source: {xp} XP Points
ar: {xp} نقطة خبرة

source: Login
ar: تسجيل الدخول

source: Login as Guest
ar: تسجيل الدخول كضيف

source: Logout
ar: تسجيل الخروج

source: Create Room
ar: إنشاء غرفة

source: Join Room
ar: الانضمام لغرفة

source: Friends List
ar: قائمة الأصدقاء

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Display Name
ar: اسم العرض

source: Create Account
ar: إنشاء حساب

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: التسجيل

source: Language
ar: اللغة

# rankIron
source: Iron
ar: حديدي

# rankBronze
source: Bronze
ar: برونزي

# rankSilver
source: Silver
ar: فضي

# rankGold
source: Gold
ar: ذهبي

# rankPlatinum
source: Platinum
ar: بلاتيني

# rankEmerald
source: Emerald
ar: زمردي

# rankDiamond
source: Diamond
ar: ماسي

# rankMaster
source: Master
ar: أستاذ

# rankGrandmaster
source: Grandmaster
ar: أستاذ كبير

# rankChallenger
source: Challenger
ar: متحدي

source: Play Local
ar: لعب محلي

source: Game Instructions
ar: تعليمات اللعبة

source: Privacy Policy
ar: سياسة الخصوصية

# onlineMessage
source: This game is now online so we can stay together all the time❤️
ar: اللعبه دي بقت اونلاين عشان نفضل مع بعض طول الوقت❤️

# onlineTermsTitle
source: Online Play Terms and Conditions
ar: أحكام وشروط اللعب أونلاين

source: Agree
ar: موافق

# createAccountTitle
source: Create Account
ar: إنشاء حساب

# accountCreatedSuccess
source: Account created successfully ✅
ar: تم إنشاء الحساب بنجاح ✅

source: Choose Avatar
ar: اختر الصورة الرمزية

source: Name
ar: الاسم

# nameHint
source: Enter your name here
ar: اكتب اسمك هنا

source: Show
ar: إظهار

source: Hide
ar: إخفاء

# alreadyHaveAccountLogin
source: Already have an account? Login
ar: لديك حساب بالفعل؟ تسجيل الدخول

source: Please enter name
ar: من فضلك أدخل الاسم

# nameTooShort
source: Name is too short
ar: الاسم قصير جداً

source: Please enter email
ar: من فضلك أدخل البريد الإلكتروني

source: Invalid email
ar: بريد إلكتروني غير صالح

source: Please enter password
ar: من فضلك أدخل كلمة المرور

# passwordTooShort
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

# loginTitle
source: Login
ar: تسجيل الدخول

source: Create New Account
ar: إنشاء حساب جديد

source: How Many Players
ar: إحنا عددنا

source: How Many Spies
ar: كام جاسوس

source: How Many Minutes
ar: كام دقيقة

source: Choose Game Type:
ar: اختر نوع اللعبة:

source: Start Playing
ar: ابدأ اللعب

# chooseAvatarTitle
source: Choose Avatar
ar: اختر الصورة الرمزية

source: Free
ar: مجانية

source: Coming Soon (Premium)
ar: قريباً (مدفوعة)

# premiumAvatarsMessage
source: These avatars will be available soon 🔒
ar: هذه الصور ستكون متاحة قريباً 🔒

# playOnlineTitle
source: Play Online
ar: اللعب أونلاين

# onlineIntroMessage
source: To start playing online, please login or create a new account
ar: للبدء في اللعب أونلاين، قم بتسجيل الدخول أو إنشاء حساب جديد

source: Game Rules
ar: قواعد اللعبة

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

source: Are you sure?
ar: هل أنت متأكد؟

source: No
ar: لا

source: Yes
ar: نعم

source: Game Result
ar: نتيجة اللعبة

source: Exit Game
ar: خروج من اللعبة

source: Exit to Home
ar: الخروج للرئيسية

source: New Game
ar: لعبة جديدة

source: Start Timer
ar: ابدأ التايمر

source: Result
ar: النتيجة

source: Start Voting
ar: ابدأ التصويت

source: The word was:
ar: الكلمة كانت:

source: Time spent
ar: الوقت المستغرق

source: Player number
ar: اللاعب رقم

source: Spy
ar: جاسوس

source: Detective
ar: محقق

# areYouSureEndGame
source: Are you sure you want to end the game?
ar: هل أنت متأكد أنّك تريد إنهاء اللعبة؟

source: Restart Round
ar: إعادة الدور

# areYouSureRestartRound
source: Do you want to restart the round from the beginning?
ar: هل تريد إعادة الدور من البداية؟

# tapToKnowRole
source: Tap to know your role
ar: اضغط لمعرفة دورك

# youAreSpy
source: You are the spy!
ar: أنت الجاسوس!

# youAreDetective
source: You are a detective!
ar: أنت محقق!

source: Start Game
ar: ابدأ اللعب

source: Next Player
ar: اللّاعب اللي بعده

# spyInstructions
source: Try to figure out the {category} without them suspecting you!
ar: حاول تعرف {category} من غير ما يشّكّوا فيك!

source: The food is
ar: الأكلة هي

source: The place is
ar: المكان هو

source: The player is
ar: اللاعب هو

# gameDescription
source: 🔸 Social game for 3 or more players 🔥 🔸 Everyone knows the location or food or player etc... except the spy! 👀
ar: 🔸 لعبة اجتماعية لـ 3 لاعبين أو أكثر 🔥 🔸 الكل يعرف المكان أو الأكلة لاعب الكورة الخ… ماعدا الجاسوس! 👀

source: 🎯 Spy Objective:
ar: 🎯 هدف الجاسوس:

# spyObjectiveDetails
source: - Pretend you know and don't get discovered. - Listen to questions and answers. - Try to figure out the location or food. - But ❗ you can't say the location or food until the round ends. - If you guess correctly → spies win. - If you're wrong: ❌ You lose a point. ✅ Everyone else gets a point.
ar: - يتظاهر إنه عارف وميتكشفش. - يسمع الأسئلة والإجابات. - يحاول يعرف المكان أو الأكلة. - لكن ❗ ممنوع يقول المكان أو الأكلة إلا بعد انتهاء اللفة. - لو قالها صح → الجواسيس يكسبوا. - لو غلط: ❌ بيتخصم منه نقطة. ✅ وكل لاعب تاني بياخد نقطة.

# detectiveObjective
source: 🧠 Other Players' Objective:
ar: 🧠 هدف باقي اللاعبين:

# detectiveObjectiveDetails
source: - Ask each other yes or no questions only. - Try to discover who the spy is from their answers. - After the round ends, discuss and agree on who the spy is. If you can't agree, whoever guessed correctly gets a point along with the spy.
ar: - يسألوا بعض أسئلة بنعم أو لا فقط. - يحاولوا يكتشفوا مين الجاسوس من إجاباته. - بعد انتهاء الجولة، يتناقشوا ويتفقوا ويختاروا مين الجاسوس لو متفقوش اللي قال صح ليه نقطه مع الجاسوس.

# privacyPolicyContent
source: ❗ Privacy Policy for "Min el Gasos" App We care about your privacy and want you to understand how we handle your data: 1. 🔒 We do not collect any personal data. 2. 📵 The app works completely offline. 3. 👤 We do not ask you to log in or enter any information. 4. 🙫 We do not use cookies. 5. 🧠 Your activity within the app is not tracked. 📌 Using the app means you agree to this policy. If you do not agree, please do not use the app. Thank you 🙏
ar: ❗ سياسة الخصوصية لتطبيق "من الجاسوس" نحن نهتم بخصوصيتك، ونرغب في أن تفهم كيف نتعامل مع بياناتك: 1. 🔒 لا نقوم بجمع أي بيانات شخصية. 2. 📵 التطبيق يعمل بالكامل بدون إنترنت. 3. 👤 لا نطلب منك تسجيل الدخول أو إدخال أي معلومات. 4. 🙫 لا نستخدم ملفات تعريف الارتباط (Cookies). 5. 🧠 لا يتم تتبع نشاطك داخل التطبيق. 📌 استخدامك للتطبيق يعني موافقتك على هذه السياسة. إذا كنت لا توافق، يرجى عدم استخدام التطبيق. شكرًا لك 🙏

source: Game Session
ar: جلسة اللعبة

source: Players in Session
ar: اللاعبون في الجلسة

source: Voting Phase
ar: مرحلة التصويت

source: Round
ar: الجولة

source: Session Stats
ar: إحصائيات الجلسة

source: Player Roles
ar: أدوار اللاعبين

source: SPIES
ar: الجواسيس

source: DETECTIVES
ar: المحققون

source: Location
ar: الموقع

source: Game Information
ar: معلومات اللعبة

source: Timer Duration
ar: مدة العداد

source: Total Players
ar: إجمالي اللاعبين

source: minutes
ar: دقائق

source: votes
ar: أصوات

source: voted
ar: صوت

source: Players in Game
ar: اللاعبون في اللعبة

# voteForSpy
source: Vote for who you think is the SPY!
ar: صوت لمن تعتقد أنه الجاسوس!

# votingInstructions
source: Choose carefully - the player with the most votes will be revealed as spy or innocent.
ar: اختر بعناية - اللاعب الحاصل على أكثر الأصوات سيتم الكشف عنه إما كجاسوس أو بريء.

# selectPlayerToVote
source: Select a player to vote for:
ar: اختر لاعباً للتصويت له:

source: Submit Vote
ar: إرسال الصوت

source: Vote Submitted!
ar: تم إرسال الصوت!

source: You voted for:
ar: لقد صوتت لـ:

# waitingForOthers
source: Waiting for other players to vote...
ar: في انتظار اللاعبين الآخرين للتصويت...

source: Voting Status
ar: حالة التصويت

source: Show Results
ar: إظهار النتائج

source: Voting Results
ar: نتائج التصويت

source: Most Voted Player:
ar: اللاعب الأكثر حصولاً على الأصوات:

source: Reveal Rules
ar: إظهار القواعد

source: Start Round
ar: بدء الجولة

source: Next Round
ar: الجولة التالية

source: End Session
ar: إنهاء الجلسة

source: Game in Progress...
ar: اللعبة جارية...

source: Timer Paused by Host
ar: تم إيقاف العداد بواسطة المضيف

# waitForHostTimer
source: Wait for the host to control the timer
ar: انتظر المضيف للتحكم في العداد

# voteSubmittedSuccess
source: Vote submitted successfully!
ar: تم إرسال الصوت بنجاح!

source: Error submitting vote
ar: خطأ في إرسال الصوت

source: Error showing results
ar: خطأ في إظهار النتائج

source: Host
ar: المضيف

source: Start Round Timer
ar: بدء عداد الجولة

source: Host Controls
ar: أدوات المضيف
